fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договора</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/CommonModules/ВКМ_РеализацияАгентскихДоговоровСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_МассовоеСозданиеАбонентскихОтгрузок(Период) Экспорт
	
 Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка,
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы
	|ПОМЕСТИТЬ ВТ_ДействующиеАбоненскиеДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|	И (ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &НачалоМесяца
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &КонецМесяца)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Договор.Ссылка
	|ПОМЕСТИТЬ ВТ_РеализацииАбоненские
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|	И
	|		РеализацияТоваровУслуг.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|
	|	ВТ_ДействующиеАбоненскиеДоговора.Ссылка КАК Договор,
	|	ВТ_ДействующиеАбоненскиеДоговора.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	|	ВТ_ДействующиеАбоненскиеДоговора.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	|	ЕСТЬNULL(ВТ_РеализацииАбоненские.Ссылка, ""Пусто"") КАК Реализация
	|ИЗ
	|	ВТ_ДействующиеАбоненскиеДоговора КАК ВТ_ДействующиеАбоненскиеДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеализацииАбоненские КАК ВТ_РеализацииАбоненские
	|		ПО ВТ_ДействующиеАбоненскиеДоговора.Ссылка = ВТ_РеализацииАбоненские.ДоговорСсылка";

Запрос.УстановитьПараметр("НачалоМесяца", Период.ДатаНачала);
Запрос.УстановитьПараметр("КонецМесяца", Период.ДатаОкончания);

РезультатЗапроса = Запрос.Выполнить();

Выборка = РезультатЗапроса.Выбрать();
  
  Пока Выборка.Следующий() Цикл
Если Выборка.Реализация = "Пусто" Тогда
	 ВКМ_СоздатьРеализацию(Выборка.Период, Выборка.Договор);
КонецЕсли;

КонецЦикла;
КонецПроцедуры	
	
Процедура ВКМ_СоздатьРеализацию(Период, Договор) Экспорт
	
 НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
 НовыйДокумент.Договор = Договор;
 НовыйДокумент.Дата = ТекущаяДата();
 НовыйДокумент.Контрагент = Договор.Владелец;
 НовыйДокумент.Организация = Договор.Организация;
 //НовыйДокумент.Заполнить();
 НовыйДокумент.ОбработкаЗаполнения(, , );
 НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение(НовыйДокумент);
 НовыйДокумент.Записать();
 //ВКМ_ВыполнитьАвтозаполнение(НовыйДокумент, Договор); 
КонецПроцедуры

Процедура ВКМ_ВыполнитьАвтозаполнение(Документ, Договор) Экспорт
	
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если НЕ ЗначениеЗаполнено(НоменклатураАбонентскаяПлата)ИЛИ НЕ ЗначениеЗаполнено(НоменклатураРаботыСпециалиста)
	Тогда ОбщегоНазначения.СообщитьПользователю("Не заполнена Номенклатура");
	Возврат;
	КонецЕсли;
	
	ТабУслуги = Документ.Услуги;
	ТабУслуги.Очистить();
	
	ВКМ_ДобавитьАбоненскуюПлату(НоменклатураАбонентскаяПлата, ТабУслуги,Договор);
	ВКМ_ДобавитьВыполненныеКлиентуРаботы(НоменклатураРаботыСпециалиста, ТабУслуги, Документ);
//	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма")
КонецПроцедуры

Процедура ВКМ_ДобавитьВыполненныеКлиентуРаботы(НоменклатураРаботыСпециалиста, ТабУслуги, Документ)
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот Как СуммаКОплатеОборот,
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоМесяца, &КонецМесяца, Месяц,) КАК
		|		ВКМ_ВыполненныеКлиентуРаботыОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент = РеализацияТоваровУслуг.Контрагент
		|		И ВКМ_ВыполненныеКлиентуРаботыОбороты.Договора = РеализацияТоваровУслуг.Договор";
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Документ.Дата));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Документ.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	НоваяСтрока = ТабУслуги.Добавить();
	НоваяСтрока.Номенклатура = НоменклатураРаботыСпециалиста;
	НоваяСтрока.Сумма = Выборка.СуммаКОплатеОборот;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВКМ_ДобавитьАбоненскуюПлату(НоменклатураАбонентскаяПлата, ТабУслуги, Договор)
		
АбонентскаяПлата= Договор.ПолучитьОбъект();
СуммаАбонентскойПлаты = АбонентскаяПлата.ВКМ_СуммаАбонентскойПлаты;
	Если СуммаАбонентскойПлаты = 0 Тогда
		Возврат;
		//Сообщение("Не задана сумма Абоненского обслуживания");
	КонецЕсли;	
	
		НоваяСтрокаТЧ = ТабУслуги.Добавить();
	    НоваяСтрокаТЧ.Номенклатура = НоменклатураАбонентскаяПлата;
	    НоваяСтрокаТЧ.Сумма = СуммаАбонентскойПлаты;
  КонецПроцедуры

#КонецОбласти
